const initialOption = [
  ['未选择', '研究创新', '创业实践', '社会服务', '美育素养', '体育素养'],
  [
    ['未选择'],
    ['未选择', '学术竞赛', '科研及学术立项', '学术论文', '著作', '发明创造'],
    ['未选择', '创业竞赛', '创业实践', '社会实践'],
    ['未选择', '社会工作', '志愿服务'],
    ['未选择', '美育表彰', '美育参与'],
    ['未选择', '体育表彰', '体育参与'],
  ],
  [
    [['未选择']],
    [
      ['未选择'],
      ['未选择', '国家级竞赛', '省级竞赛', '校级竞赛', '校区/书院/学院级竞赛'],
      ['未选择', '国家级立项', '省级立项', '校级立项'],
      ['未选择', '特类期刊', '核心A', '核心B', 'SCI', 'EI(不含会议录取文章)', 'CSSCI', 'CSSCI扩展版'],
      ['未选择', '主要作者出版专著'],
      ['未选择', '国家发明专利(公开)'],
    ],
    [
      ['未选择'],
      ['未选择', '国家级竞赛', '省级竞赛', '校级竞赛'],
      ['未选择', '创业实践'],
      ['未选择', '社会实践优秀个人', '实践活动团队-队长', '实践活动团队-队员', '国家级实践调查报告', '省级实践调查报告', '校级调查报告'],
    ],
    [
      ['未选择'],
      ['未选择', '优秀团干部', '最美团支书', '优秀共青团员', '军训优秀学员', '五四评比优秀个人', '自强之星', '榜样的力量年度人物', '优秀学生干部', '优秀班长', '优秀学生', '三好学生', '十佳班长', '十佳团员',
        '先进班集体-班长/团支书', '先进班集体-班委支委', '优良学风班-班长/团支书', '优良学风班-班委支委', '先进团支部-团支书', '先进团支部-宣传/组织委员', '十佳团支部-团支书', '十佳团支部-宣传/组织委员', '学生组织', '社团负责人'],
      ['未选择', '志愿服务先进个人', '十佳志愿者', '志愿服务先进集体第一负责人', '志愿服务先进集体副部长/干事', '坚持志愿服务并有典型事迹'],
    ],
    [
      ['未选择'],
      ['未选择', '国家级赛事', '省级赛事', '校级赛事', '校区级赛事', '书院级/院级/社团级'],
      ['未选择', '校级及以上且未获奖', '其他级别且未获奖', '撰写新闻稿件'],
    ],
    [
      ['未选择'],
      ['未选择', '国家级', '省级', '校级', '校区级', '书院/院级'],
      ['未选择', '校级及以上未获奖', '其他级别未获奖'],
    ],
  ],
  [
    [[['未选择']]],
    [
      [['未选择']],
      [
        ['未选择'],
        ['未选择', '特等奖', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '特等奖', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '特等奖', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '特等奖', '一等奖', '二等奖', '三等奖', '优秀奖'],
      ],
      [
        ['未选择'],
        ['未选择', '第一作者', '第二作者', '第三作者', '第四作者', '第五作者'],
        ['未选择', '第一作者', '第二作者', '第三作者', '第四作者', '第五作者'],
        ['未选择', '第一作者', '第二作者', '第三作者', '第四作者', '第五作者'],
      ],
      [
        ['未选择'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
      ],
      [
        ['未选择'],
        ['未选择', '第一作者', '第二作者', '第三作者及以后'],
      ],
      [
        ['未选择'],
        ['未选择', '第一作者', '第二作者', '第三作者', '第四作者', '第五作者及以后'],
      ],
    ],
    [
      [['未选择']],
      [
        ['未选择'],
        ['未选择', '特等奖', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '特等奖', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '特等奖', '一等奖', '二等奖', '三等奖', '优秀奖'],
      ],
      [
        ['未选择'],
        ['未选择', '创业团队主要负责人', '其他负责人'],
      ],
      [
        ['未选择'],
        ['未选择', '国家级表彰', '省级表彰', '校级表彰', '院级表彰'],
        ['未选择', '国家级表彰', '省级表彰', '校级表彰', '院级表彰', '校级立项', '院级立项'],
        ['未选择', '国家级表彰', '省级表彰', '校级表彰', '院级表彰', '校级立项', '院级立项'],
        ['未选择', '一等奖', '二等奖', '三等奖'],
        ['未选择', '一等奖', '二等奖', '三等奖'],
        ['未选择', '一等奖', '二等奖', '三等奖'],
      ],
    ],
    [
      [['未选择']],
      [
        ['未选择'],
        ['校级'], ['校级'], ['校级'], ['校级'], ['校级'],
        ['未选择', '校级', '校级提名', '院级'],
        ['未选择', '校级', '院级'],
        ['未选择', '国家级', '省级', '校级', '院级'],
        ['未选择', '国家级', '省级', '校级', '院级'],
        ['未选择', '国家级', '省级', '校级', '院级'],
        ['未选择', '国家级', '省级', '校级', '院级'],
        ['校级'], ['校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '校级'], ['校级'],
        ['未选择', '学生骨干任职', '优秀骨干'],
        ['未选择', '五星', '四星', '三星', '二星'],
      ],
      [
        ['未选择'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '国家级', '省级', '校级'],
        ['未选择', '优秀', '良好'],
      ],
    ],
    [
      [['未选择']],
      [
        ['未选择'],
        ['未选择', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '一等奖', '二等奖', '三等奖', '优秀奖'],
        ['未选择', '一等奖', '二等奖', '三等奖', '优秀奖'],
      ],
      [
        ['未选择'], ['未获奖'], ['未获奖'],
        ['未选择', '国家级媒体', '省级媒体', '校级/校区媒体', '其他'],
      ],
    ],
    [
      [['未选择']],
      [
        ['未选择'],
        ['未选择', '破纪录', '第一名', '第二名', '第三名', '第四名', '第五名', '第六名', '第七名', '第八名', '一等奖', '二等奖', '三等奖'],
        ['未选择', '破纪录', '第一名', '第二名', '第三名', '第四名', '第五名', '第六名', '第七名', '第八名', '一等奖', '二等奖', '三等奖'],
        ['未选择', '破纪录', '第一名', '第二名', '第三名', '第四名', '第五名', '第六名', '第七名', '第八名', '一等奖', '二等奖', '三等奖'],
        ['未选择', '第一名', '第二名', '第三名', '第四名', '第五名', '第六名', '第七名', '第八名', '一等奖', '二等奖', '三等奖'],
        ['未选择', '第一名', '第二名', '第三名', '第四名', '第五名', '第六名', '一等奖', '二等奖', '三等奖'],
      ],
      [
        ['未选择'], ['未获奖'], ['未获奖'],
      ],
    ],
  ],
];
const deepCopy = (obj) => {
  const out = []; let i = 0; const len = obj.length;
  for (;i < len; i++) {
    if (obj[i] instanceof Array) {
      out[i] = deepCopy(obj[i]);
    } else out[i] = obj[i];
  }
  return out;
};
let count = 0;
const score = [0, 0, 0, 0, 50, 45, 40, 35, 30, 0, 40, 35, 30, 25, 20, 0, 30, 25, 20, 15, 10, 0, 20, 15, 10, 5, 3,
  0, 0, 30, 20, 10, 8, 5, 0, 25, 15, 8, 5, 3, 0, 15, 8, 4, 3, 2,
  0, 0, 40, 20, 3, 0, 30, 15, 3, 0, 20, 10, 3, 0, 50, 25, 3, 0, 50, 25, 3, 0, 50, 25, 3, 0, 30, 15, 3,
  0, 0, 20, 10, 5, 0, 0, 40, 20, 10, 5, 3,
  0, 0, 0, 50, 45, 40, 35, 30, 0, 40, 35, 30, 25, 20, 0, 30, 25, 20, 15, 10,
  0, 0, 50, 15, 0, 0, 30, 15, 10, 8, 0, 30, 15, 10, 8, 5, 4, 0, 25, 10, 8, 5, 3, 2,
  0, 30, 25, 20, 0, 20, 15, 10, 0, 15, 10, 5,
  0, 0, 15, 15, 8, 5, 5, 0, 15, 10, 5, 0, 20, 5, 0, 50, 30, 15, 5, 0, 50, 30, 15, 5,
  0, 50, 30, 15, 5, 0, 50, 30, 15, 5, 20, 20, 0, 30, 20, 7, 0, 15, 10, 3,
  0, 30, 20, 7, 0, 15, 10, 3, 0, 30, 20, 7, 0, 15, 10, 3, 0, 10, 5, 0, 6, 3, 0, 6, 4, 2, 1,
  0, 0, 40, 30, 7, 0, 50, 30, 15, 0, 40, 30, 15, 0, 30, 20, 7, 0, 10, 5,
  0, 0, 0, 50, 40, 30, 20, 0, 30, 20, 15, 10, 0, 20, 15, 5, 3, 0, 15, 10, 5, 3, 0, 10, 6, 3, 2,
  0, 2, 2, 0, 15, 8, 5, 2,
  0, 0, 0, 50, 40, 37, 35, 33, 31, 29, 27, 25, 40, 36, 31, 0, 40, 35, 32, 29, 26, 23, 20, 17, 15, 35, 30, 23,
  0, 25, 18, 16, 14, 12, 10, 8, 6, 4, 18, 15, 10, 0, 16, 14, 12, 10, 8, 6, 4, 2, 16, 13, 8,
  0, 10, 8, 6, 4, 2, 1, 10, 7, 3, 0, 2, 1,
];
const scoreArr = deepCopy(initialOption[3]);
for (let i = 0; i <= initialOption[0].length - 1; i++) {
  for (let j = 0; j <= initialOption[1][i].length - 1; j++) {
    for (let k = 0; k <= initialOption[2][i][j].length - 1; k++) {
      for (let l = 0; l <= initialOption[3][i][j][k].length - 1; l++) {
        scoreArr[i][j][k][l] = score[count];
        count++;
        // console.log(initialOption[0][i], initialOption[1][i][j], initialOption[2][i][j][k], initialOption[3][i][j][k][l], scoreArr[i][j][k][l]);
      }
    }
  }
}
const getScoreArr = () => {
  return scoreArr;
};
export default getScoreArr;
